Конфигурация/Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ВариантыОтчетов/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ПредопределенныйВариант И Не ДополнительныеСвойства.Свойство("ОбновлениеВариантов") Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменение предопределенных вариантов отчетов запрещено!", , , , Отказ);
		
	ИначеЕсли НЕ ДополнительныеСвойства.Свойство("ОбновлениеВариантов") И Не ЭтотОбъект.ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ВариантыОтчетов.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
			|ГДЕ
			|	ВариантыОтчетов.Ссылка <> &Ссылка
			|	И НЕ ВариантыОтчетов.ПометкаУдаления
			|	И ВариантыОтчетов.Ключ = &Ключ
			|	И ВариантыОтчетов.Наименование = &Наименование
			|	И ВариантыОтчетов.Организация = &Организация
			|	И ВариантыОтчетов.Автор = &Автор
			|	И ВариантыОтчетов.Общий = &Общий
			|	И ВариантыОтчетов.Родитель = &Родитель";
		
		Запрос.УстановитьПараметр("Ключ", 			ЭтотОбъект.Ключ);
		Запрос.УстановитьПараметр("Ссылка", 		ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Наименование", 	ЭтотОбъект.Наименование);
		Запрос.УстановитьПараметр("Организация", 	ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Автор", 			ЭтотОбъект.Автор);
		Запрос.УстановитьПараметр("Общий", 			ЭтотОбъект.Общий);
		Запрос.УстановитьПараметр("Родитель", 		ЭтотОбъект.Родитель);
		
		Если Не Запрос.Выполнить().Пустой() Тогда
		
			ТекстОшибки = "Имя """ + ЭтотОбъект.Наименование + """ занято, необходимо указать другое наименование.";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
		
		КонецЕсли; 
						
	КонецЕсли; 
	
КонецПроцедуры
